__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
model_1 (Model)                 (None, 28, 28, 512)  1460096     input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 14, 14, 1)    4609        model_1[1][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 14, 14, 1)    4           conv2d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 14, 14, 1)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 14, 14, 1)    0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 8, 8, 1)      0           dropout_1[0][0]                  
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1, 8, 8, 1)   0           lambda_1[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 7, 8, 8, 1)   0           lambda_2[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 8, 8, 8, 1)   0           lambda_2[0][0]                   
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 8, 8, 8, 1)   2           concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 8, 8, 8, 1)   4           conv3d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 8, 8, 8, 1)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 8, 8, 8, 1)   28          leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 8, 8, 8, 1)   4           conv3d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 8, 8, 8, 1)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 8, 8, 8, 4)   112         concatenate_1[0][0]              
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 8, 8, 8, 4)   8           leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 8, 8, 8, 4)   16          conv3d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 8, 8, 8, 4)   16          conv3d_4[0][0]                   
__________________________________________________________________________________________________
add_17 (Add)                    (None, 8, 8, 8, 4)   0           batch_normalization_2[0][0]      
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 8, 8, 8, 4)   0           add_17[0][0]                     
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 8, 8, 8, 4)   0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 8, 8, 8, 1)   109         dropout_2[0][0]                  
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 8, 8, 8)      0           conv3d_5[0][0]                   
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 8, 8, 8)      0           lambda_4[0][0]                   
==================================================================================================
Total params: 1,465,008
Trainable params: 4,890
Non-trainable params: 1,460,118
__________________________________________________________________________________________________
